app/views/pets/index.html.erb

        <td class= "text-center"><%= pet.client.name if pet.client %></td>
        <td class= "text-center"><%= pet.records.count %></td>
        <td class= "text-center">
            <% pet.records.each do |record| %>
---
SELECT  "records".* FROM "records" WHERE "records"."pet_id" = ? AND "records"."pet_id" = ? LIMIT ?  [["pet_id", 1], ["pet_id", 0], ["LIMIT", 1]]
SELECT COUNT(*) FROM "records" WHERE "records"."pet_id" = ?  [["pet_id", 1]]
SELECT "records".* FROM "records" WHERE "records"."pet_id" = ?  [["pet_id", 1]]