app/views/clients/index.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."client_id" = ?  [["client_id", 1]]
SELECT COUNT(*) FROM "pets" WHERE "pets"."client_id" = ?  [["client_id", 1]]
---
        <td><%= client.name %></td>
        <td><%= client.pets.count %></td>
        <!-- <td>
          <% client.pets.each do |pet| %>