app/views/clients/show.html.erb

        <td><%= @client.name %></td>
        <td><%= @client.pets.count %></td>
        <td><% @client.pets.each do |pet| %>
---
SELECT "pets".* FROM "pets" WHERE "pets"."client_id" = ?  [["client_id", 1]]
SELECT COUNT(*) FROM "pets" WHERE "pets"."client_id" = ?  [["client_id", 1]]