app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Glenn"], ["address", "No te importa 666"], ["created_at", "2020-02-27 21:35:25.138352"], ["updated_at", "2020-02-27 21:35:25.138352"]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save