app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"
SELECT  "records".* FROM "records" WHERE "records"."pet_id" = ? AND "records"."pet_id" = ? LIMIT ?  [["pet_id", 1], ["pet_id", 0], ["LIMIT", 1]]
---
  def index
    @pets = Pet.all
    @record = Record.where(pet_id: @pet)

SELECT "records".* FROM "records" WHERE "records"."pet_id" = ?  [["pet_id", 1]]
---
  def show
    @record = Record.where(pet_id: @pet)

INSERT INTO "pets" ("animal", "breed", "name", "birthdate", "created_at", "updated_at", "client_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

UPDATE "pets" SET "client_id" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["client_id", 1], ["updated_at", "2020-02-27 22:20:12.621031"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @pet.update(pet_params)

DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 5]]
---
  def destroy
    @pet.destroy

SELECT "clients"."name", "clients"."id" FROM "clients" ORDER BY "clients"."name" ASC
---
    def set_clients
      @clients_array = Client.order(:name).pluck(:name, :id)