app/controllers/records_controller.rb

  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("weight", "height", "description", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["weight", 17.0], ["height", 55.0], ["description", "Desparasitante"], ["pet_id", 3], ["created_at", "2020-02-27 21:47:33.192935"], ["updated_at", "2020-02-27 21:47:33.192935"]]

    def set_record
      @record = Record.find(params[:id])
---
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def set_pets
      @pets_array = Pet.order(:name).pluck(:name, :id)
---
SELECT "pets"."name", "pets"."id" FROM "pets" ORDER BY "pets"."name" ASC